# PROYECTO 1

## Ejercicio 1

In [2]:
import pandas as pd
import numpy as np

In [22]:
diccionario = {
    "Fecha": ["12-01-2022","13-01-2022","14-01-2022","15-01-2022"],
    "Precio Unit":[15.50, 3.50, 2.20,5],
    "Ventas":[23, 40, 100, 76]
}

df = pd.DataFrame(diccionario)

In [23]:
df

        Fecha  Precio Unit  Ventas
0  12-01-2022         15.5      23
1  13-01-2022          3.5      40
2  14-01-2022          2.2     100
3  15-01-2022          5.0      76

In [24]:
df['Ganancia'] = df['Ventas']*df['Precio Unit']
df['Ganancia - Desc 5%'] = (df['Precio Unit'] - df['Precio Unit']*0.005).round(2)*df['Ventas']

In [25]:
df

        Fecha  Precio Unit  Ventas  Ganancia  Ganancia - Desc 5%
0  12-01-2022         15.5      23     356.5              354.66
1  13-01-2022          3.5      40     140.0              139.20
2  14-01-2022          2.2     100     220.0              219.00
3  15-01-2022          5.0      76     380.0              377.72

## Ejercicio 2

In [43]:
ingreso = {
    "empleado1":200,
    "empleado2":435,
    "empleado3":567,
    "empleado4":123,
    "empleado5":657,
    "empleado6":876,
    "empleado7":1023
}

tr = pd.DataFrame(ingreso.values())
tr.describe().round(1)

            0
count     7.0
mean    554.4
std     331.6
min     123.0
25%     317.5
50%     567.0
75%     766.5
max    1023.0

## Ejercicio 3

In [43]:
dict3 = {
    "Mes":["Enero", "Febrero", "Marzo", "Abril", "Mayo"],
    "Ventas":[30500, 35600, 28300, 33900, 42500],
    "Gastos":[22000, 23450, 18100, 35700, 32450]
}
df3 = pd.DataFrame(dict3)
df3

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23450
2    Marzo   28300   18100
3    Abril   33900   35700
4     Mayo   42500   32450

In [32]:
# 1. Columna 1 = Gasto/Ventas*100

df3['Columna 1'] = (df3['Gastos']/df3['Ventas'])*100
df3

       Mes  Ventas  Gastos   Columna 1
0    Enero   30500   22000   72.131148
1  Febrero   35600   23450   65.870787
2    Marzo   28300   18100   63.957597
3    Abril   33900   35700  105.309735
4     Mayo   42500   32450   76.352941

In [33]:
# 2. Columna 2 = Si Ventas>= 30000, imprimir “Meta Superada”, caso contrario imprimir “Meta no Superada”.

df3['Columna 2'] = ["Meta superada" if val >= 30000 else "Meta no superada" for val in df3['Ventas']]
df3

       Mes  Ventas  Gastos   Columna 1         Columna 2
0    Enero   30500   22000   72.131148     Meta superada
1  Febrero   35600   23450   65.870787     Meta superada
2    Marzo   28300   18100   63.957597  Meta no superada
3    Abril   33900   35700  105.309735     Meta superada
4     Mayo   42500   32450   76.352941     Meta superada

In [35]:
# 3. Columna 3 = Si Gasto>Ventas, calcular el sobre gasto.
df3['Columna 3'] = np.where(df3['Gastos']>df3['Ventas'], df3['Gastos']-df3['Ventas'], 0)
df3

       Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
0    Enero   30500   22000   72.131148     Meta superada          0
1  Febrero   35600   23450   65.870787     Meta superada          0
2    Marzo   28300   18100   63.957597  Meta no superada          0
3    Abril   33900   35700  105.309735     Meta superada       1800
4     Mayo   42500   32450   76.352941     Meta superada          0

In [36]:
# 4. Obtener el total de las ventas de los últimos 3 meses

df3.tail(3)

     Mes  Ventas  Gastos   Columna 1         Columna 2  Columna 3
2  Marzo   28300   18100   63.957597  Meta no superada          0
3  Abril   33900   35700  105.309735     Meta superada       1800
4   Mayo   42500   32450   76.352941     Meta superada          0

In [44]:
# 5. Obtener el total de gastos de febrero a abril
meses = ['Febrero', 'Marzo', 'Abril']
df3[df3['Mes'].isin(meses)]

       Mes  Ventas  Gastos
1  Febrero   35600   23450
2    Marzo   28300   18100
3    Abril   33900   35700

## Ejercicio 4

In [35]:
df4 = pd.read_csv('Data - Riesgos.csv', index_col='ID')

In [36]:
df4.size

40500

In [37]:
df4.shape

(4500, 9)

In [47]:
columnas = list(df4.columns)
columnas

['edad',
 'meses',
 'max_ant',
 'ingreso',
 'score',
 'tipo_vivienda',
 'zona',
 'nivel',
 'riesgo']

In [46]:
df4.index

Int64Index([2208, 2211, 2212, 2216, 2218, 2219, 2226, 2227, 2228, 2230,
            ...
            1486, 1487, 1488, 1491, 1493, 1494, 1495, 1496, 1497, 1499],
           dtype='int64', name='ID', length=4500)

In [45]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4500 entries, 2208 to 1499
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   edad           4487 non-null   float64
 1   meses          4494 non-null   float64
 2   max_ant        4496 non-null   float64
 3   ingreso        4495 non-null   float64
 4   score          4495 non-null   float64
 5   tipo_vivienda  4500 non-null   int64
 6   zona           4494 non-null   float64
 7   nivel          4500 non-null   int64
 8   riesgo         4500 non-null   int64
dtypes: float64(6), int64(3)
memory usage: 351.6 KB

In [39]:
df4.head(10)

      edad  meses  max_ant  ingreso  score  tipo_vivienda  zona  nivel  riesgo
ID
2208  33.0  128.0      6.0   3230.0  192.0              2   3.0      2       1
2211  32.0  185.0      7.0   2930.0  217.0              2   1.0      5       1
2212  28.0    NaN      7.0   1883.7  202.0              2   1.0      2       1
2216  56.0  200.0      0.0    850.0  194.0              2   1.0      5       1
2218  32.0  131.0     65.0   3200.0  200.0              2   1.0      2       1
2219  34.0  145.0      6.0   7000.0  196.0              2   5.0      2       1
2226   NaN  114.0      0.0   2171.5  178.0              2   2.0      1       1
2227  27.0  116.0      0.0    800.0  169.0              2   1.0      5       1
2228  26.0  182.0      6.0   3150.0  190.0              4   3.0      5       1
2230  25.0  154.0      1.0   2600.0  189.0              2   1.0      2       1

In [40]:
df4.tail(10)

,edad,meses,max_ant,ingreso,score,tipo_vivienda,zona,nivel,riesgo
ID,,,,,,,,,
1486,59.0,288.0,0.0,30000.00,207.0,2,1.0,2,0
1487,55.0,294.0,57.0,9300.00,238.0,4,1.0,2,0
1488,53.0,148.0,106.0,30000.00,219.0,4,1.0,2,0
1491,29.0,198.0,94.0,5250.00,214.0,2,1.0,2,0
1493,32.0,195.0,41.0,7500.00,219.0,2,1.0,2,0
1494,54.0,510.0,87.0,24000.00,214.0,2,1.0,2,0
1495,63.0,305.0,99.0,9880.73,219.0,2,5.0,2,0
1496,48.0,194.0,124.0,23000.00,224.0,4,1.0,2,0
1497,39.0,245.0,121.0,12450.00,240.0,4,5.0,2,0
1499,65.0,674.0,38.0,20000.00,238.0,4,5.0,2,0

In [41]:
df4.isnull().sum()

edad             13
meses             6
max_ant           4
ingreso           5
score             5
tipo_vivienda     0
zona              6
nivel             0
riesgo            0
dtype: int64